# ArrayingNotSupportedForElements Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ArrayFailures..::..ArrayingNotSupportedForElements Property
BuiltInFailures..::..ArrayFailures Class See Also
---
Arraying is not currently supported for the selected elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ArrayingNotSupportedForElements { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ArrayingNotSupportedForElements As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ArrayingNotSupportedForElements {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ArrayFailures Class
Autodesk.Revit.DB Namespace